let carrData = [
    {
        image:'gods/odin.jpg',
        name: 'Одін',
        about: "Всеотець в скандинавській традиції, широко шановане скандинавсько-германське божество, верховний бог у германо-скандинавській міфології, батько і ватажок асів, син Бора і Бестли, онук Бурі. Мудрець і шаман, знавець рун і оповідей (саг), цар-жрець, чаклун-воїн, бог війни та перемоги, покровитель військової аристократії, господар Вальхалли та король валькірій.",
    },
    {
        image:'gods/loki.jpg',
        name: 'Локі',
        about: 'Син йотуна Фарбауті і Лаувейї, побратим Одіна, також згадується як бог хитрості, вогню, пристрасті, або ж головний Трікстер пантеону. Походить з роду йотунів, але аси дозволили йому жити з ними в Асгарді за його незвичайний розум, хитрість та мудрість.',
    },
    {
        image:'gods/freya.jpg',
        name: 'Фрейя',
        about: "Богиня кохання, хтивості та урочистостей. Вона керує королівством Фолкванг, і вона – Королева Валькірій. Її часто зображують із золотими намистами, і вона ніколи не позбавлена ​​своєї колісниці, витягнутої кішками. Фрейя була членом богів Ваніра і одружилася з богом на ім'я Од, якого іноді плутають з Одіном.",
    },
    {
        image:'gods/freyr.jpg',
        name: 'Фрейр',
        about: 'У германо-скандинавській міфології бог родючості, миру, процвітання та чоловічої сили, подавач сонячного світла, ясної погоди та доброго врожаю. Походить із роду ванів, син вана Ньорда, брат Фрейї.',
    },
    {
        image:'gods/frigg.jpg',
        name: 'Фрігг',
        about: 'У германо-скандинавській міфології дружина Одіна, верховна богиня. Родоначальниця роду асів. Заступає любові, шлюбу, домівки, дітонародження. Є провидицею, якою відома доля будь-якої людини, але яка не ділиться цими знаннями ні з ким.',
    },
    {
        image:'gods/balder.jpg',
        name: 'Бальдр',
        about: 'Це бог весни, краси і цноти у скандинавській міфології. Бальдр подібний присутнім у міфології багатьох народів божествам умираючої і відроджуваної природи, що опікуються землеробством або усіма рослинами, такі боги звичайні для міфологій і релігій народів, що живуть або жили на територіях, для природи яких характерна сезонність.',
    },
    {
        image:'gods/thor.jpg',
        name: 'Тор',
        about: 'У германо-скандинавській міфології один із асів, бог грому та блискавок, що захищає богів і людей від велетнів та чудовиськ. «Тричі народжений» старший син Одіна і богині землі Йорд.',
    },
    {
        image:'gods/tyr.jpg',
        name: 'Тюр',
        about: 'У германо-скандинавській міфології - однорукий бог честі та війни. Один із асів, син Одіна та велетні, сестри Гіміра. Тюр втратив руки, коли аси вирішили скувати величезного вовка Фенріра чарівним ланцюгом Глейпнір. За однією з версій, Тюр вклав свою руку в пащу Фенріра на відсутність недобрих намірів.',
    },
    {
        image:'gods/heimdall.jpg',
        name: 'Геймдалль',
        about: "У германо-скандинавській міфології бог із роду асів, страж богів та світового дерева, вважається сином Одіна та дев'яти матерів-велетень.",
    },
    {
        image:'gods/hel.jpg',
        name: 'Хель',
        about: 'У германо-скандинавській міфології володарка світу мертвих (Хельхейма), дочка Локі та велетні Ангрбоди, одне з трьох хтонських чудовиськ.',
    }
]


let carrApp = {
    data() {
        return {
            cars: carrData,
            currentCar: carrData[0],
            currentIndex: 0,
        }
    },
    methods: {
        showCar(index) {
            this.currentCar = carrData[index];
            this.currentIndex = index;
        }
    },
}
Vue.createApp(carrApp).mount('#vue-cont')