let carrData = [
    {
        image:'world/asgard.jpg',
        name: 'Асгард',
        about: "Асгард - світ, що належить асам. Великий та світлий світ, з високими горами, зеленими рівнинами та відкритими плоскогір'ями. Саме в Асгарді розташовані палаци головних божеств. На найвищій горі цього світу знаходиться легендарна Вальхалла. В Асгарді боги живуть і займаються щоденними справами, проводять збори та вирішують важливі питання, захищаються від нападів велетнів та чудовиськ. Оточує світ асів велика стіна, яку спорудив великий будівельник із своїм конем Свальдіфарі. З іншими світами Асгард з'єднує райдужний міст Біврест і охороняє його Хеймдаль — сторож богів. Але не злочинні його стіни, доки стоїть на варті Тор зі своїм молотом.",
    },
    {
        image:'world/midgard.jpg',
        name: 'Мідгард',
        about: 'Мідгард населений людьми і вважається центральним царством скандинавської космології. Він керується природними законами та населений різними людськими племенами та цивілізаціями. У скандинавській міфології створення перших людей, Аска та Ембла, відбулося в Мідгарді. Боги Одін, Вілі і Ве вдихнули в них життя, наділили силою розуму і свідомості. Мідгард часто асоціюється з боротьбою та пригодами людських героїв у скандинавській міфології. Він служить місцем дії багатьох міфічних оповідань і епічних битв між богами, велетнями та іншими міфічними істотами. Також вважається, що під час апокаліптичної події Рагнарок Мідгард буде спустошений, і виникне новий світ. Мідгард оточує світовий змій Йормунганд, син бога Локі.',
    },
    {
        image:'world/vanaihem.jpg',
        name: 'Ванайхем',
        about: "Ванахейм є домом для Ванів, божественної групи, яка складається з богів і богинь, пов'язаних з природою, родючістю, магією та мистецтвом. У скандинавській міфології Ванахейм зображується як прекрасний і плідний світ, де процвітають сади, поля та річки. Ванів вважають багатими і мудрими богами, а їхніми головними божествами є Ньорд, бог моря, і його діти Фрей і Фрея, бог і богиня родючості. Ванахейм також відіграє важливу роль у міфах про створення світу і взаємодію з іншими світами. Вані використовує торжества та зустрічі з іншими богами, зокрема з богами з Асгарду, що ведуть до обміну знаннями, обрядів і шлюбів.",
    },
    {
        image:'world/jotunheim.jpg',
        name: 'Йотунхейм',
        about: "у скандинавській міфології царство, населене йотунами, яких часто перекладають як велетні. Це один із дев’яти світів скандинавської космології. Йотунхейм зображений як сувора та нерівна земля, яка характеризується горами, лісами та льодовиками. У скандинавській міфології Йотунхейм служить місцем для різноманітних взаємодій і конфліктів між богами та йотунами. Це місце, де боги ризикують випробувати свою силу, брати участь у битвах і шукати союзів або вести переговори з велетнями. Королівство часто зображується як небезпечне та непередбачуване місце, населене грізними істотами та населене хаотичними силами.",
    },
    {
        image:'world/muspelheim.jpg',
        name: 'Муспельхейм',
        about: "У скандинавській міфології Муспельхейм виявлений домом вогняного духу Суртра, вогненного велетня, який є одним із символів апокаліптичного події Рагнарок. Суртр і його вогняні сили гравці важливу роль у битві, що призведе до знищення світу і його оновлення. Муспельхейм також має зв'язок з Асгардом, домом богів. Згідно з міфологією, вогненний світ Муспельхейм і льодовий світ Ніфльхейм знаходяться поряд і становлять початок всесвіту. Вони знаходяться в протилежних кінцях пустоти Гіннунгагапу, а при зіткненні вогню і льоду створюється життєтворчий розплав, з якого народжується світ.",
    },
    {
        image:'world/niflheim.jpg',
        name: 'Ніфльхейм',
        about: 'У скандинавській космології Ніфльхейм розташований на одному з нижніх рівнів Світового дерева, Іггдрасіль, поряд з іншим царством під назвою Муспельхейм, яке асоціюється з вогнем і теплом. Ніфльхейм описується як замерзла та туманна земля з крижаними річками та крижаними вітрами. Кажуть, що це місце народження первісної істоти Імір і джерело багатьох крижаних річок і льодовиків. У деяких версіях міфу тут також проживають інші морозні гіганти та жахливі істоти.',
    },
    {
        image:'world/svartalvheim.jpg',
        name: 'Свартальвхейм',
        about: 'Це світ, де живуть свартальфи, гноми або темні ельфи, і він зазвичай описується як темний, печерний реалм. Гноми в скандинавській міфології представляють собою рідку форму створення, що перебуває між богами і людьми. Вони відзначаються своїми знаннями про ковальство, магію і майстерність у виготовлених предметах. Свартальфи часто зображуються як ремісники і ковали, які вміють виготовляти чарівні зброї та інші речі з металу. Свартальфхейм має репутацію таємничого та міського місць. Він часто асоціюється з печерами, глибиною землі і темрявою. ',
    },
    {
        image:'world/alfheim.jpg',
        name: 'Альвхейм',
        about: "Це один із Дев'яти Світів і зазвичай асоціюється зі світлими ельфами. Його володарем є бог Бальдр. У скандинавській космології Альфхейм розташований на найвищому рівні Світового дерева, Іггдрасіль, над Мідгардом, але нижче Асгарду. Відповідно до скандинавської міфології, Альфхейм — це царство надзвичайної краси та яскравості. Його описують як місце, наповнене рясним світлом, пишними лісами та луками. Кажуть, що світлі ельфи, також відомі як Ljósálfar, проживають в Альфхеймі. Їх зображують як істот надзвичайної краси та сяйва, які часто асоціюються з природою, родючістю та захистом.",
    },
    {
        image:'world/helheim.jpg',
        name: 'Хельхейм',
        about: "царство в скандинавській міфології, пов'язане з потойбічним життям. Це місце, куди, як кажуть, йдуть душі, які померли від старості чи хвороби, але не в бою. Гельхеймом править богиня Хель, яка є дочкою бога-трикстера Локі та велетки Ангрбоди. У скандинавській космології Хельхейм розташований нижче Мідгарду і описується як похмуре та холодне царство. Його часто зображують у вигляді царства тіней, туману та туману, через яке протікає річка під назвою Гйолль. Вхід до Хельхейма охороняє жахливий пес Гарм. Гельхейм — це місце призначення для тих, хто не загинув у бою та не досяг слави в бою, на відміну від воїнів, які вибрали для відправлення у Вальгаллу. У Хельхаймі душі ведуть відносно мирне існування, вільне від болю та страждань, але позбавлене радощів і задоволень живого світу.",
    },
]


let carrApp = {
    data() {
        return {
            cars: carrData,
            currentCar: carrData[0],
            currentIndex: 0,
        }
    },
    methods: {
        showCar(index) {
            this.currentCar = carrData[index];
            this.currentIndex = index;
        }
    },
}
Vue.createApp(carrApp).mount('#vue-cont')